#include <stdio.h>
/* Ввести c клавиатуры массив из 5 элементов, найти среднее 
 арифметическое всех элементов массива. Формат входных данных -
 5 целых не нулевых чисел через пробел. Формат результата -
 Одно число в формате "%.3f" */
int main() {
    int arr[5]; // Объявление массива из 5 элементов
    
    for(int i = 0; i < 5; i++) {
        scanf("%d", &arr[i]);
    }
    
    int sum = 0;
    for(int i = 0; i < 5; i++) {
        sum += arr[i];
    }
    float x = (float)sum / 5;
    printf("%.3f\n", x);
    
    return 0;
}
