/*
Считать массив из 10 элементов и найти в нем два максимальных элемента 
и напечатать их сумму.
Формат входных данных - 10 целых чисел через пробел.
Формат результата -Сумма двух максимальных элементов 
 */

#include <stdio.h>
#include <stdio.h>

int main() {
    int arr[10];   
    // Переменные для хранения максимальных значений
    int max1 = -1000000;  // Первый максимум
    int max2 = -1000000;  // Второй максимум    
    // Ввод 10 элементов массива через пробел
    for(int i = 0; i < 10; i++) {
        scanf("%d", &arr[i]);
    }   
    // Поиск двух максимальных элементов
    for(int i = 0; i < 10; i++) {
        if (arr[i] > max1) {
            max2 = max1;
            max1 = arr[i];
        }
        else if (arr[i] > max2) {
            max2 = arr[i];
        }
    }
    printf("%d\n", max1 + max2);   
    return 0;
}

