/*
Считать массив из 12 элементов и посчитать среднее арифметическое 
элементов массива. Формат входных данных - 12 целых чисел через пробел
Формат результата - Среднее арифметическое в формате "%.2f"
 */
#include <stdio.h>
int main() {
    int arr[12];
    int sum = 0;
    float res;
    for(int i = 0; i < 12; i++) {
        scanf("%d", &arr[i]);
    }
    for(int i = 0; i < 12; i++) {
        sum += arr[i];
    }
    res = (float)sum / 12;
    printf("%.2f\n", res);   
    return 0;
}
