/*
 Составить функцию которая находит след матрицы в двумерном массиве. 
 Показать пример ее работы на матрице из 5 на 5 элементов. 
 След матрицы - это сумма элементов на главной диагонали.
Формат входных данных - 25 целых чисел через пробел.
Формат результата - Одно целое число. 
 */

#include <stdio.h>

// Функция для вычисления следа матрицы
int find_trace(int matrix[5][5]) {
    int trace = 0;  // Инициализируем сумму следа   
    // Проходим по главной диагонали
    for (int i = 0; i < 5; i++) {
        trace += matrix[i][i];  // Суммируем элементы главной диагонали
    }   
    return trace;
}
int main() {
    int matrix[5][5];  // Объявляем матрицу 5x5   
    // Считываем элементы матрицы
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
            scanf("%d", &matrix[i][j]);
        }
    }    
    // Вычисляем и gtxfnftv след матрицы
    int result = find_trace(matrix);
    printf("%d\n", result);   
    return 0;
}
