/*
Написать программу на языке си: Определить количество положительных 
элементов квадратной матрицы, превышающих по величине среднее 
арифметическое всех элементов главной диагонали. Реализовать функцию 
среднее арифметическое главной диагонали.
Формат входных данных - 5 строк по 5 целых чисел через пробел.
Формат результата - одно целое число.
 */
#include <stdio.h>
// Функция для вычисления среднего арифметического главной диагонали
double diagonal(int matrix[5][5]) {
    int sum = 0;
    for (int i = 0; i < 5; i++) {
        sum += matrix[i][i];
    }
    return (double)sum / 5.0;
}
int main() {
    int matrix[5][5];
    // Ввод матрицы
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
            scanf("%d", &matrix[i][j]);
        }
    }
    // Вычисление среднего арифметического главной диагонали
    double average = diagonal(matrix);
    // Подсчет положительных элементов, превышающих среднее
    int count = 0;
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 5; j++) {
            if (matrix[i][j] > 0 && matrix[i][j] > average) {
                count++;
            }
        }
    }
    printf("%d\n", count);
    return 0;
}
