/*
Написать функцию и программу демонстрирующую работу данной функции. 
Вывести в порядке возрастания цифры, входящие в десятичную запись 
натурального числа N, не более 1000 цифр. Цифра пробел сколько раз 
данная цифра встречается в числе.
Формат входных данных - Натуральное число не более 1000 цифр.
Формат результата - Цифры входящие в число через пробел в порядке 
возрастания. От самой младшей цифры до самой старшей и количество. 
 */

#include <stdio.h>
#include <string.h>

void print_digits(const char* number) //Функция для подсчета и вывода цифр заданного числа
{   
    int count[10] = {0}; // Массив для подсчета количества каждой цифры  
    for (int i = 0; i < strlen(number); i++) {      
        int digit = number[i] - '0';// Преобразование символа в число (вычитаем код символа '0')
        count[digit]++;
    }   
    // Печать результата в порядке возрастания цифр
    for (int i = 0; i < 10; i++) {
        if (count[i] > 0) {
            printf("%d %d\n", i, count[i]);
        }
    }
}
int main() {
    char number[1001];  // Массив для числа длиной до 1000 символов + '\0'  
    // Запрос на ввод числа, содержащего не более 1000 цифр
    fgets(number, sizeof(number), stdin);       
  //  number[strcspn(number, "\n")] = '\0';// Удаление символа новой строки, если он есть   
    // Вызов функции для обработки числа
    print_digits(number);   
    return 0;
}
