/*
В последовательности записаны целые числа от M до N 
( M меньше N, M больше или равно 1)в произвольном порядке, но одно
из чисел пропущено (остальные встречаются ровно по одному разу). 
N не превосходит 1000. Последовательность заканчивается числом 0. 
Определить пропущенное число. Формат входных данных - Последовательность
 целых чисел от M до N. M, N не превосходит 1000.
Формат результата - Одно целое число
 */
#include <stdio.h>

int find_number() {
    int numbers[1001] = {0}; // Индексация от 0 до 1000   
    int num;
    int min = 1001; // Начальное значение больше максимально возможного
    int max = 0;    // Начальное значение меньше минимально возможного   
    // Считываем числа до 0
    while (1) {
        scanf("%d", &num);        
        if (num == 0) break; // Завершаем ввод при появлении нуля        
        numbers[num] = 1;        
        if (num < min) min = num;
        if (num > max) max = num;
    }   
    // Поиск пропущенного числа в диапазоне от min до max
    for (int i = min; i <= max; i++) {
        if (numbers[i] == 0) {
            return i; // Возвращаем первое пропущенное число
        }
    }    
    return -1;
}
int main() {
    printf("%d\n", find_number());
    return 0;
}
